/*
Задание-3 :
Скопируйте код из Задания-2.
По данному коду надо продолжить восстановление объекта.
После запуска кода в консоль должно быыть выведено то,
что находится в комментарии.
* */

//антипаттерн : не рекомендуется напрямую обращаться к "закрытому" свойству объекта
console.log(person._name);
//антипаттерн : не рекомендуется напрямую обращаться к "закрытому" свойству объекта
console.log(person._age);
person.printInfo();
console.log('------------------------------------');

person.getName();
person.setName('Peter');
person.getName();
console.log('------------------------------------');

person.getName();
person.setName('');
person.getName();
console.log('------------------------------------');

person.getAge();
person.setAge(31);
person.getAge();
console.log('------------------------------------');

person.getAge();
person.setAge(-1);
person.getAge();
console.log('------------------------------------');

/*******************************
 Ivan
 21
 Name Ivan age 21
 ------------------------------------
 Ivan
 Peter
 ------------------------------------
 Peter
 Пустое имя недопустимо!
 Peter
 ------------------------------------
 21
 31
 ------------------------------------
 31
 Отрицательный возраст недопустим!
 31
 ------------------------------------
 */