/**
 * ЗАДАЧА :
 *
 * Уровень 1 :
 * Необходимо написать скрипт, при запуске которого, с интервалом в 1 секунду
 * выводятся сообщения в консоль :
 * ----> ОДИН
 * ----> ДВА
 * ----> ТРИ
 * ----> ЧЕТЫРЕ
 * ----> ПЯТЬ
 * Можно использовать любые конструкции : и колбеки, и промисы.
 * ============================================================================
 *
 * Уровень 2 :
 * Задание из уровня 1, НО
 * на каждом этапе генерируется случайное число rand
 * и если rand <= 0.8, то в консоль выводится соответствующее сообщение,
 * например '----> ОДИН',
 * в противном случае в консоль выводится :
 * 'Math.random() > 0.8'
 * ============================================================================
 *
 * Уровень 3 :
 * Задание из уровня 2, НО
 * Если на каком-либо этапе работы скрипта случайное число rand
 * превысит величину 0.8, то после вывода в консоль
 * 'Math.random() > 0.8'
 * больше ничего выводиться не должно.
 *
 * Например :
 *
 * ----> ОДИН
 * 'Math.random() > 0.8'
 *
 * или
 *
 * ----> ОДИН
 * ----> ДВА
 * ----> ТРИ
 * ----> ЧЕТЫРЕ
 * 'Math.random() > 0.8'
 *
 * или
 *
 * ----> ОДИН
 * ----> ДВА
 * ----> ТРИ
 * ----> ЧЕТЫРЕ
 * ----> ПЯТЬ
 *
 * Внимание! Примеры приведены условно,
 * вариантов работы скрипта больше.
 * ============================================================================
 *
 * Уровень 4 :
 * Задание из уровня 3, НО
 * переписать код с использованием промисов
 * ============================================================================
 *
 * РЕШЕНИЕ ПРЕДОСТАВЛЯТЬ ПО УРОВНЯМ.

 * */

