// ********************************************* Рекурсия:

// ---Возведение числа в натуральную степень двумя способами:---

// 1: Цикл for

// function pow(x, n) {
//   let result = 1;
//
//   // умножаем result на x n раз в цикле
//   for (let i = 0; i < n; i++) {
//     result *= x;
//   }
//
//   return result;
// }
//
// console.log( pow(2, 3) ); // 8



// 2: Рекурсия

// function pow(x, n) {
//   if (n == 1) {
//     return x;
//   } else {
//     return x * pow(x, n - 1);
//   }
// }
//
// console.log( pow(2, 3) ); // 8

// Например, рекурсивный вариант вычисления pow(2, 4) состоит из шагов:
//
// pow(2, 4) = 2 * pow(2, 3)
// pow(2, 3) = 2 * pow(2, 2)
// pow(2, 2) = 2 * pow(2, 1)
// pow(2, 1) = 2

// Рекурсивное решение с тернарным оператором:

// function pow(x, n) {
//   return (n == 1) ? x : (x * pow(x, n - 1));
// }



// ********************************************* Рекурсивные структуры данных:

// ---Связанный список:---

// let list = {
//   value: 1,
//   next: {
//     value: 2,
//     next: {
//       value: 3,
//       next: {
//         value: 4,
//         next: null
//       }
//     }
//   }
// };